     A                                      UNIQUE
     A          R CORMAFMT
     A            COURSEID       5  0
     A            COURSENAME    25A
     A          K COURSEID
