     A                                      UNIQUE
     A          R SEMMAFMT
     A            SEMID          2  0
     A            SEMESTER      10A
     A          K SEMID
