     A          R SUBCOFMT
     A            COURSEID       5  0
     A            SUBJECTID      5  0
     A            SEMID          5  0
     A          K COURSEID
     A          K SUBJECTID
     A          K SEMID

