     A                                      UNIQUE
     A          R SUBMAFMT
     A            SUBJECTID      5  0
     A            SUBNAME       25A
     A          K SUBJECTID
